In [12]:
import pandas as pd

In [13]:
titanic = pd.read_csv('../titanic.csv')

In [14]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

# T Or transpose() methods  to transpose the rows and columns, index and columns are swapped

In [15]:
titanic.T

,0,1,2,3,4,5,6,7,8,9,...,881,882,883,884,885,886,887,888,889,890
survived,0,1,1,1,0,0,0,0,1,1,...,0,0,0,0,0,0,1,0,1,0
pclass,3,1,3,1,3,3,1,3,3,2,...,3,3,2,3,3,2,1,3,1,3
sex,male,female,female,female,male,male,male,male,female,female,...,male,female,male,male,female,male,female,female,male,male
age,22.0,38.0,26.0,35.0,35.0,NaN,54.0,2.0,27.0,14.0,...,33.0,22.0,28.0,25.0,39.0,27.0,19.0,NaN,26.0,32.0
sibsp,1,1,0,1,0,0,0,3,0,1,...,0,0,0,0,0,0,0,1,0,0
parch,0,0,0,0,0,0,0,1,2,0,...,0,0,0,0,5,0,0,2,0,0
fare,7.25,71.2833,7.925,53.1,8.05,8.4583,51.8625,21.075,11.1333,30.0708,...,7.8958,10.5167,10.5,7.05,29.125,13.0,30.0,23.45,30.0,7.75
embarked,S,C,S,S,S,Q,S,S,S,C,...,S,S,S,S,Q,S,S,S,C,Q
deck,NaN,C,NaN,C,NaN,NaN,E,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,B,NaN,C,NaN

OR

In [26]:
titanic.transpose()

    survived pclass     sex   age sibsp parch     fare embarked deck
0          0      3    male  22.0     1     0     7.25        S  NaN
1          1      1  female  38.0     1     0  71.2833        C    C
2          1      3  female  26.0     0     0    7.925        S  NaN
3          1      1  female  35.0     1     0     53.1        S    C
4          0      3    male  35.0     0     0     8.05        S  NaN
..       ...    ...     ...   ...   ...   ...      ...      ...  ...
886        0      2    male  27.0     0     0     13.0        S  NaN
887        1      1  female  19.0     0     0     30.0        S    B
888        0      3  female   NaN     1     2    23.45        S  NaN
889        1      1    male  26.0     0     0     30.0        C    C
890        0      3    male  32.0     0     0     7.75        Q  NaN

[891 rows x 9 columns]

In [27]:
titanic = titanic.T

In [28]:
titanic.head()

  survived pclass     sex   age sibsp parch     fare embarked deck
0        0      3    male  22.0     1     0     7.25        S  NaN
1        1      1  female  38.0     1     0  71.2833        C    C
2        1      3  female  26.0     0     0    7.925        S  NaN
3        1      1  female  35.0     1     0     53.1        S    C
4        0      3    male  35.0     0     0     8.05        S  NaN

In [29]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    object
 1   pclass    891 non-null    object
 2   sex       891 non-null    object
 3   age       714 non-null    object
 4   sibsp     891 non-null    object
 5   parch     891 non-null    object
 6   fare      891 non-null    object
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: object(9)
memory usage: 62.8+ KB

## Transpose() method restricts the data type of the columns to object

In [34]:
titanic.groupby(by= ['sex', 'pclass']).age.mean().unstack()

pclass          1          2          3
sex
female  34.611765  28.722973      21.75
male    41.281386  30.740707  26.507589

In [35]:
titanic.groupby(by= ['sex', 'pclass']).age.mean().unstack().T

sex        female       male
pclass
1       34.611765  41.281386
2       28.722973  30.740707
3           21.75  26.507589